W4D5/music_app/app/controllers/albums_controller.rb

  def new
    @album = Album.new
    @bands = Band.all
    @band = Band.find(params[:band_id])
---
SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]