W5D2/Rails Reddit/app/controllers/posts_controller.rb

  def create
    @post = Post.new(posts_params)
    @post.author_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "The Sun"], ["url", "The moon"], ["content", "The night"], ["author_id", 21], ["created_at", "2017-10-31 23:33:41.802286"], ["updated_at", "2017-10-31 23:33:41.802286"]]