W5D2/Rails Reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Attack on Titan"], ["description", "Greatest Manga Evah??!"], ["moderator", 1], ["created_at", "2017-10-31 21:22:45.843647"], ["updated_at", "2017-10-31 21:22:45.843647"]]
---
  def create
    @sub = Sub.new(subs_params)
    @sub.moderator_id = current_user.id

    if @sub.save