W5D2/Rails Reddit/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
---

  <% Sub.all.each do |subbing| %>

SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 21]]
---
      <label>
        <input type="checkbox" name="post[sub_ids][]" value="<%= subbing.id %>" <%= "checked" if @post.sub_ids.include?(subbing.id) %>><%= subbing.title %>