W5D2/Rails Reddit/app/views/posts/new.html.erb


  <% Sub.all.each do |subbing| %>
---
SELECT "subs".* FROM "subs"