W5D2/Rails Reddit/app/views/posts/show.html.erb


<% @post.subs.each do |subber| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 11]]